rottenpotatoes/app/controllers/movies_controller.rb

  def index
    flag = false
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering = {:order => :title}
      @title_header = 'hilite'
    when 'release_date'
      ordering = {:order => :release_date}
      @date_header = 'hilite'
    end

    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = 'New Title', "release_date" = '2004-06-05 14:57:28.000000', "updated_at" = '2014-06-05 14:57:28.421178' WHERE "movies"."id" = 1

  def similar
    m = Movie.find(params[:id])
    if (m.director.nil? || m.director.empty?)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'm.director'